Repository: MatchLab-App/MatchLab-iOS
Catalog: Projects/MatchLab/Resources/Localizable.xcstrings
Source language: ko
Languages: en, ja

# accessibility.back
source: 뒤로
en: Back
ja: 戻る

# accessibility.close.menu
source: 메뉴 닫기
en: Close menu
ja: メニューを閉じる

# accessibility.logo
source: 매치랩 로고
en: MatchLab logo
ja: MatchLab ロゴ

# accessibility.menu
source: 메뉴 열기
en: Open menu
ja: メニューを開く

# accessibility.search
source: 이름으로 검색
en: Search by name
ja: 名前で検索

# accessibility.selected.attack
source: 선택한 공격 타입
en: Selected attack type
ja: 選択した攻撃タイプ

# accessibility.selected.defense
source: 선택한 상대 타입
en: Selected opponent type
ja: 選択した相手タイプ

# action.confirmed
source: 확인했습니다
en: I understand
ja: 確認しました

# action.next
source: 다음으로
en: Next
ja: 次へ

# action.restart
source: 처음으로
en: Start over
ja: 最初から

# attack.type.description
source: 1개를 선택하세요
en: Choose one
ja: 1つ選択してください

# attack.type.prompt
source: 아래의 타입 아이콘에서 시전 기술의 타입을 고르세요
en: Choose the move type from the icons below
ja: 下のタイプアイコンから 技のタイプを選んでください

# attack.type.title
source: 시전 기술 타입
en: Move type
ja: 技タイプ

# effectiveness.double.title
source: 2배 데미지
en: 2x damage
ja: 2倍ダメージ

# effectiveness.half.title
source: 0.5배 데미지
en: 0.5x damage
ja: 0.5倍ダメージ

# effectiveness.none.description
source: 효과가 없다
en: No effect
ja: 効果がない

# effectiveness.none.title
source: 0배 데미지
en: 0x damage
ja: 0倍ダメージ

# effectiveness.normal.description
source: 중립 상성
en: Neutral matchup
ja: 等倍相性

# effectiveness.normal.title
source: 1배 데미지
en: 1x damage
ja: 1倍ダメージ

# effectiveness.quad.title
source: 4배 데미지
en: 4x damage
ja: 4倍ダメージ

# effectiveness.quarter.title
source: 0.25배 데미지
en: 0.25x damage
ja: 0.25倍ダメージ

# effectiveness.strong.description
source: 효과가 굉장하다!
en: Super effective!
ja: 効果は抜群!

# effectiveness.weak.description
source: 효과가 별로다
en: Not very effective
ja: 効果はいまひとつ

# language.english
source: 영어
en: English
ja: 英語

# language.japanese
source: 일본어
en: Japanese
ja: 日本語

# language.korean
source: 한국어
en: Korean
ja: 韓国語

# menu.recent
source: 최근 기록
en: Recent records
ja: 最近の記録

# menu.settings
source: 설정
en: Settings
ja: 設定

# menu.type.chart
source: 상성표 보기 (6세대 이후)
en: Type chart (Gen 6+)
ja: 相性表を見る (第6世代以降)

# notice.body.first
source: 본 애플리케이션은 Nintendo, Game Freak, Creatures Inc., 또는 The Pokemon Company와 어떠한 공식적 제휴, 승인, 보증 관계도 없습니다.
en: This app is not affiliated with, endorsed by, or sponsored by Nintendo, Game Freak, Creatures Inc., or The Pokemon Company.
ja: 本アプリは Nintendo、Game Freak、Creatures Inc.、The Pokemon Company とは公式の提携、承認、保証関係にありません。

# notice.body.second
source: Pokemon 및 그 관련 캐릭터의 저작권은 해당 소유자에게 귀속됩니다. 본 앱은 팬 프로젝트로서 순수한 비상업적 목적 하에 개발되었습니다.
en: Pokemon and related characters belong to their respective owners. This app is a fan project developed for non-commercial purposes.
ja: Pokemon および関連キャラクターの著作権は各権利者に帰属します。本アプリは非営利目的のファンプロジェクトです。

# notice.body.third
source: 이 앱에 사용된 모든 리소스(아이콘, 데이터, 그래픽 등)는 The Pokemon Company의 공식 자료를 사용하지 않고, 독자적으로 재구성 및 제작된 비공식 리소스입니다. 자유로운 공유 및 사용이 가능합니다.
en: All resources used by this app are independently recreated unofficial resources and may be shared and used freely.
ja: 本アプリのリソースは公式素材ではなく、独自に再構成した非公式リソースです。自由に共有および利用できます。

# notice.title
source: 이 앱은 공식 서비스가 아닙니다
en: This app is unofficial
ja: このアプリは公式サービスではありません

# opponent.first.prompt
source: 상대의 첫번째 타입을 고르세요
en: Choose the opponent's first type
ja: 相手の1つ目のタイプを選んでください

# opponent.second.prompt
source: 두 번째 타입을 고르거나 다음으로 버튼을 눌러 상대 타입 선택을 종료하세요
en: Choose a second type or press Next to finish
ja: 2つ目のタイプを選ぶか、次へを押して終了してください

# opponent.type.description
source: 1~2개를 선택하세요
en: Choose one or two
ja: 1〜2つ選択してください

# opponent.type.title
source: 상대 타입
en: Opponent type
ja: 相手タイプ

# pokemon.type.bug
source: 벌레
en: Bug
ja: むし

# pokemon.type.dark
source: 악
en: Dark
ja: あく

# pokemon.type.dragon
source: 드래곤
en: Dragon
ja: ドラゴン

# pokemon.type.electric
source: 전기
en: Electric
ja: でんき

# pokemon.type.fairy
source: 페어리
en: Fairy
ja: フェアリー

# pokemon.type.fighting
source: 격투
en: Fighting
ja: かくとう

# pokemon.type.fire
source: 불꽃
en: Fire
ja: ほのお

# pokemon.type.flying
source: 비행
en: Flying
ja: ひこう

# pokemon.type.ghost
source: 고스트
en: Ghost
ja: ゴースト

# pokemon.type.grass
source: 풀
en: Grass
ja: くさ

# pokemon.type.ground
source: 땅
en: Ground
ja: じめん

# pokemon.type.ice
source: 얼음
en: Ice
ja: こおり

# pokemon.type.none
source: 미선택
en: None
ja: 未選択

# pokemon.type.normal
source: 노말
en: Normal
ja: ノーマル

# pokemon.type.poison
source: 독
en: Poison
ja: どく

# pokemon.type.psychic
source: 에스퍼
en: Psychic
ja: エスパー

# pokemon.type.rock
source: 바위
en: Rock
ja: いわ

# pokemon.type.steel
source: 강철
en: Steel
ja: はがね

# pokemon.type.water
source: 물
en: Water
ja: みず

# role.attack
source: 공격
en: Attack
ja: 攻撃

# role.defense
source: 수비
en: Defense
ja: 防御

# search.placeholder
source: 이름으로 타입 검색
en: Search type by name
ja: 名前でタイプ検索

# settings.contact
source: 문의하기
en: Contact
ja: お問い合わせ

# settings.file.access
source: 파일 접근 권한
en: File access permission
ja: ファイルアクセス許可

# settings.language
source: 언어 설정
en: Language
ja: 言語設定

# settings.read.full.notice
source: 안내문 전문 읽기
en: Read full notice
ja: 案内文を全文読む

# start.disclaimer
source: 본 애플리케이션은 Nintendo, Game Freak, Creatures Inc., 또는 The Pokemon Company와 어떠한 공식적 제휴, 승인, 보증 관계도 없습니다.
en: This app is not affiliated with, endorsed by, or sponsored by Nintendo, Game Freak, Creatures Inc., or The Pokemon Company.
ja: 本アプリは Nintendo、Game Freak、Creatures Inc.、The Pokemon Company とは公式の提携、承認、保証関係にありません。

# start.touch.screen
source: 화면을 터치하세요
en: Touch the screen
ja: 画面をタッチしてください

# start.welcome
source: 환영합니다
en: Welcome!
ja: ようこそ!
